libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
/***************************************************************************
* NAME:         eeprom.c
*----------------------------------------------------------------------------
* Copyright (c)
*----------------------------------------------------------------------------
* DATE:         2019-07-12
* REVISION:         V1.0
*----------------------------------------------------------------------------
* NOTE:
*
* Modified:
*****************************************************************************/

/*---------------------C O M P L I E R  C O M M A N D----------------*/

/*---------------------I N C L U D  F I L E S------------------------*/
#include "proc.h"
#include "pwm.h"
#include "adc.h" 
#include "ntc.h"
#include "user_comm.h"
#include "att7053bu.h"
#include "bord.h"
#include "flash.h"
#include "uart.h"
#include "prjlib.h"
#include "stm32f0xx_hal_flash.h"
#ifdef DEBUG_AFU
#include "fsl_debug_console.h"
#endif

#define WORK_PARA_SECTOR_ADDR    0x0800FC00

#define CMD_CLEAR_ONLINE              0X00
#define CMD_CHECK_ONLINE              0X01
#define CMD_INQUIRE_BASIC_INFO        0X02
#define CMD_INQUIRE_CURRENT_INFO      0X03
#define CMD_READ_WORK_PARA            0X04
#define CMD_WRITE_WORK_PARA           0X05

#define CMD_SET_TEMPE                 0X06 

#define CMD_READ_ATT_PARA             0X08
#define CMD_SET_ATT_PARA              0X09
#define CMD_CLEAR_ATT_PARA            0X0A

#define CMD_SET_LIMITVOLAT_H          0X10
#define CMD_SET_LIMITVOLAT_L          0X11
#define CMD_SET_SWITCH                0X12
#define CMD_SET_LIMITAMP_PARA         0X13
#define CMD_SET_LIMITPOWER_PARA       0X14  
#define CMD_SORT_ORDER                0X15
#define CMD_SORT_LEVE                 0X16
#define CMD_AUTO_ALLOW                0X17


#define CMD_READ_ALL_WORK_PARA        0X20
#define CMD_WRITE_ALL_WORK_PARA       0X21

#define CMD_READ_ALL_ATT_PARA         0X22
#define CMD_WRITE_ALL_ATT_PARA        0X23

#define CMD_NOT_MANUAL                0X30  

#define STATUS_SWITCH                 0X01 
#define STATUS_SWITCH_MANUAL          0X02 

#define ALARM_LEAKAGE               (uint8_t)0X01 //漏电保护事件
#define ALARM_TEMPERATURE           (uint8_t)0X02 //过温提醒事件
#define ALARM_TEMPERATURE_OVER      (uint8_t)0X04 //过温保护事件
#define ALARM_SHORT                 (uint8_t)0X10 //短路保护事件


#define ALARM_POWER                 (uint16_t)0X08u//过载保护事件
#define ALARM_VOLTAGE_HIGH          (uint16_t)0X20u//过压保护事件
#define ALARM_VOLTAGE_LOW           (uint16_t)0X40u//欠压保护事件

#define ALARM_CLOSE                 (uint16_t)0X80u //合闸事件
#define ALARM_MANUAL_OPEN           (uint16_t)0X100u//手动分闸事件
#define ALARM_SHORTANTICIPATION     (uint16_t)0X200u//短路预判事件
#define ALARM_AMPOVER               (uint16_t)0X400u//过流保护事件
#define ALARM_LACKOFPHASE           (uint16_t)0X1000u//缺相保护事件
#define ALARM_BRAKEFAILURE          (uint16_t)0X8000u//故障跳闸事件


#define DESIGN_TEMPERATURE          100

#define NUM_leakageamp  3
#define NUM_tempmax  4
#define NUM_currmax  5
#define NUM_short_circuit 6
#define NUM_power_smax 7
#define NUM_voltmin  8
#define NUM_voltmax  9
#define NUM_elecmax  11
#define REFERENCE_LEAKGEAMP  23
uint32_t dianya=0;
uint8_t gpio_flag=0;
uint8_t gpio_flag2=0;
/*---------------------M A C R O  D E F I N I T I O N S--------------*/
/*---------------------V A R  D E F I N I T I O N S------------------*/
uint16_t adcvalue=0;
extern TIM_HandleTypeDef htim15;
struct workpara_t workpara = {
  0x00,
  0x02,   //版本
  0x02,   //设备类型
  0x02,
  63,
  0, //地址
  23,     //最大漏电电流23ma
  80,  //温度

  54,  //NTC常数
  0x0000, //事件码
  2200,  //最大视在功率2200w

  0.081396046, //电压系数
  10, //ͨ通道1电流系数 在 MV MA的情况下扩大100倍，用于抵消算法误差
  0.001432766, //通道2电流系数
  3233, //通道1功率系数
  0.000990873, //通道2功率系数
  3200, //脉冲常数

  0x64,  //hf_const
  0x0000,
  0xFF92,
  0xF33A,
  200,
  200,

  270, //最大电压270000mv
  170, //最低电压170000mv

  63000,  //最大电流63000ma
  181002001, // 设备序列号
  0,
  0,
  0,
  0,
  0,
  0,
  0,
  20,
  20000,
  0,
  0
};
struct workdata_t  workdata;

static uint8_t  Flag_leakageamp=0;
static uint8_t  Flag_tempmax=0;
uint8_t  Flag_cross_limitamp=0;
uint8_t         Flag_w_currmax=0;
static uint8_t  Flag_currmax=0;
static uint8_t  Flag_short_circuit=0;
static uint8_t  Flag_power_smax=0;
static uint8_t  Flag_voltmin=0;
static uint8_t  Flag_voltmax=0;
static uint8_t  Flag_elecmax=0;
static uint8_t  Flag_RepeatSwitch = 0;//重合闸标志 1为允许重合闸
static uint8_t  Flag_LeakageTestRepeatSwitch = 0;
static uint8_t  Flag_V_RepeatSwitch = 0;
static uint8_t  Flag_LEAKAGE=0;
 uint8_t led_flag=0;
 uint8_t led_flag2=0;
uint8_t  Flag_leakagetest=0;
//static uint8_t  Flag_FAULT=0;

/*---------------------E X T E R N  V A R  D E C L A R E S-----------*/
static uint32_t tickms = 0;
static uint32_t tick_10ms = 0;
static uint8_t hand_switch_state = 1;//手动分合闸状态  0为分闸
static uint8_t swremote_control = 1;//1为允许远程控制
static uint8_t SW_RepeatStatus = 0;//1为允许远程控制
static uint8_t Led_SerialNUM=0;
static uint8_t Led_shiny=0;
static uint8_t Brakefailure=1;
uint8_t Brakefailure2=0;
uint8_t last_switchstatus;
uint8_t last_switchstate;
uint8_t Duty_ratio=50;
uint16_t Pwm_Cycle=666;
uint8_t SW_Repeatcnt=0;
uint8_t SW_V_Repeatcnt=0;

uint16_t moter_closedelay=170;//144;
uint16_t moter_openzkb=100;
extern uint16_t moter_openfen;
uint16_t moter_openfen=100;
extern uint16_t adcvaluep,adcvaluep2;


uint8_t swich_prama(uint8_t	hf_flag)
{
						uint8_t za_flag=0,tflag=0,ts_flag=0,FlagSta=0;
							adcvaluep1= ADC_Getvalue(8);//fen
							adcvaluep2= ADC_Getvalue(9);//he
							adcvaluep3=ADC_Getvalue(2);//he deng
							adcvaluep4=ADC_Getvalue(3);//fen deng
							if(SW_OFF)
							{
								za_flag=0;
							}else if(SW_ON)
							{
								za_flag=1;
							}else
							{
								za_flag=2;
							}
							if(za_flag==0)
							{
								
										if(hf_flag==1&&za_flag==0)
											{
															while(hf_flag==1)	
															{
																SW_break();
																adcvaluep1= ADC_Getvalue(8);//fen
																if(adcvaluep1_avr*baifen2_fen<adcvaluep1-adcvaluep1_m&&SW_OFF)//fenza
																{
																			
																			HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
																			hf_flag=0;

