libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
																	}	
															}
													
											}
										SW_break();
										
										while(za_flag==0)
										{
													adcvaluep2= ADC_Getvalue(9);//heza
													if(adcvaluep2_avr*baifen2_he<adcvaluep2-adcvaluep2_m&&SW_ON)
													{
															
															HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
															HAL_Delay(1);
															if(!SW_ON)
															{
																za_flag=0;hf_flag=0;
															}else
															{
																za_flag=1;hf_flag=1;
															}
															
													}
											}	

	
											
									}else if(za_flag==1)
									{
		
											while(za_flag==1)
											{
//												baifen_he=0.30;
													if(hf_flag==0&&za_flag==1)
													{
															while(hf_flag==0)	
															{
																SW_break();
																HAL_Delay(1);
																HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
																HAL_Delay(15);
																adcvaluep2=ADC_Getvalue(9);//heza
																if(adcvaluep2_avr*baifen2_he<adcvaluep2-adcvaluep2_m&&SW_ON)
																{
																		hf_flag=1;FlagSta=1;
																}
																
															}
													
													}else
													{
														SW_break();
														HAL_Delay(1);
														HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
														HAL_Delay(3);
														if(FlagSta==1)
														{
															HAL_Delay(4);
														}
													}
													
													adcvaluep1= ADC_Getvalue(8);//fen
													adcvaluep3=ADC_Getvalue(2);//fen deng
													adcvaluep2= ADC_Getvalue(9);//heza
													if(adcvaluep2_avr*0.80<adcvaluep2-adcvaluep2_m)
													{
														adcvaluep2= ADC_Getvalue(9);//heza
														if(adcvaluep2_avr*0.80<adcvaluep2-adcvaluep2_m)
														{
															tflag=1;
														}
													}
													if(adcvaluep3_avr*0.90>adcvaluep3-adcvaluep3_m)
													{
															tflag=2;
													
													}else
													{
															tflag=0;
													
													}
													if(tflag>0)
													{

																HAL_Delay(8);
															if(adcvaluep1_avr*baifen2_fen<adcvaluep1-adcvaluep1_m&&SW_OFF)//fenza
															{
																	tflag=0;
																		HAL_Delay(4);
//																	baifen_he=0.50;
																		if(!SW_ON)
																		{
																			za_flag=0;hf_flag=0;
																		}else
																		{
																			za_flag=1;hf_flag=1;
																		}
																		
															}
													}
											}			
									
									}else if(za_flag==2)
									{
										
											while(za_flag==2)
											{
													SW_break();
													HAL_Delay(1);
													HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
													HAL_Delay(2);
													adcvaluep1= ADC_Getvalue(8);//fen
													adcvaluep3=ADC_Getvalue(2);//fen deng
													adcvaluep2= ADC_Getvalue(9);//heza
													if(adcvaluep2_avr*0.80<adcvaluep2-adcvaluep2_m)
													{
														adcvaluep2= ADC_Getvalue(9);//heza
														if(adcvaluep2_avr*0.80<adcvaluep2-adcvaluep2_m)
														{
															tflag=1;
														}
													}
													if(adcvaluep3_avr*0.90>adcvaluep3-adcvaluep3_m)
													{
															tflag=2;
													
													}else
													{
															tflag=0;
													
													}
													if(tflag>0)
													{

																HAL_Delay(8);
															if(adcvaluep1_avr*baifen2_fen<adcvaluep1-adcvaluep1_m&&SW_OFF)//fenza
															{
																	tflag=0;
																		HAL_Delay(4);
//																	baifen_he=0.50;
																		if(!SW_ON)
																		{
																			za_flag=0;hf_flag=0;
																		}else
																		{
																			za_flag=1;hf_flag=1;
																		}
																		
															}
													}
											}			
//										SW_break();
//										
//										while(za_flag==2)
//										{
//													adcvaluep2= ADC_Getvalue(9);//heza
//													if(adcvaluep2_avr*baifen2_he<adcvaluep2-adcvaluep2_m&&SW_ON)
//													{
//															
//															HAL_TIM_PWM_Stop(&htim15, TIM_CHANNEL_2);
//															za_flag=1;hf_flag=1;
//													}
//										}	
//										
//									
									}
									return hf_flag;


}
void workparam_init(void) {
  uint16_t crc = 0; 
  struct workpara_t  pworkpara ;
  FlashRead(WORK_PARA_SECTOR_ADDR,(uint8_t *)&pworkpara.crc,sizeof(workpara));
  crc = CRC_16(0xFFFF, (uint8_t*)&pworkpara + 2, OBJ_LEN(workpara)-2);
  if ((crc ==pworkpara.crc) && (workpara.version ==pworkpara.version)) {
    FlashRead(WORK_PARA_SECTOR_ADDR, (uint8_t*)&workpara, sizeof(workpara));
    workdata.attdata.total_enery_p = workpara.total_enery_p;
    workdata.attdata.total_enery_q = workpara.total_enery_q;
    workdata.attdata.total_enery_s = workpara.total_enery_s;
    return;
  } else {
    workpara.crc = CRC_16(0xFFFF, (uint8_t*)&workpara + 2, OBJ_LEN(workpara) - 2);
    Flash_PageErase(WORK_PARA_SECTOR_ADDR);
    FlashWrite(WORK_PARA_SECTOR_ADDR, (uint8_t*)&workpara,  sizeof(workpara));
  }
}

uint32_t gettickms(void) {
  return tickms;
}

void inctickms(void) {
  tickms++;
  if(tickms%10==0){
      tick_10ms++;
    }
}

static void attreadiup(void) { 
  static uint32_t att7053currenttick = 0;
  uint8_t temp[4];
  read_rms(ATT7053_REG_I1_RMS, &workdata.attdata.leakageamp,  0.000662148);
  read_rms(ATT7053_REG_I2_RMS, &workdata.attdata.amp,  0.023144826);
  if (TMS_IS_OVER(att7053currenttick, 10)) {
    TMS_INIT(att7053currenttick);
    if(att7053currenttick>(att7053currenttick+10)){
      att7053currenttick=0;
    }
    read_att7053bu(ATT7053_REG_PF_CNT, temp);
    read_rms(ATT7053_REG_V_RMS, &workdata.attdata.volt, 0.010445654);
		
    read_freq(&workdata.attdata.freq);
    read_power(ATT7053_REG_POW_P2, &workdata.attdata.power_p, 0.020542932);
    read_power(ATT7053_REG_POW_Q2, &workdata.attdata.power_q, 0.020542932);
    read_power(ATT7053_REG_POW_S, &workdata.attdata.power_s, 0.020542932);
    workdata.attdata.power_ps=workdata.attdata.amp*workdata.attdata.volt*workdata.attdata.power_p/workdata.attdata.power_s/100;
		
