libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
//		if(workdata.attdata.volt==0)
//		{
//			if(workdata.attdata.amp<11)
//			{
//			
//				workdata.attdata.amp=0;
//			}		
//		}
  }
}

static void energycumulative(uint16_t *energycumul,uint32_t *total_enery){
  if(*energycumul>=32){
    *total_enery+=*energycumul/32;
    *energycumul=*energycumul%32;
  }
}

static void attreadenergy(void) {
  static uint32_t att7053energytick = 0;
  uint16_t curenergy = 0;

  read_energy(ATT7053_REG_ENE_Q, &curenergy, workpara.coefficient.ec);
  workpara.pulse_mantissa_q += curenergy;
  energycumulative(&workpara.pulse_mantissa_q, &workpara.total_enery_q);

  read_energy(ATT7053_REG_ENE_S, &curenergy, workpara.coefficient.ec);
  workpara.pulse_mantissa_s += curenergy;
  energycumulative(&workpara.pulse_mantissa_s, &workpara.total_enery_s);
    
  read_energy(ATT7053_REG_ENE_P, &curenergy, workpara.coefficient.ec);
  workpara.pulse_mantissa_p += curenergy;
  energycumulative(&workpara.pulse_mantissa_p, &workpara.total_enery_p);

  if (TMS_IS_OVER(att7053energytick, 3600000)) { 
    TMS_INIT(att7053energytick);
    saveparam();
  }
}

void att7053pro(void) {
  attreadiup();
  attreadenergy(); 
}

void  adcpro(void){	
  workdata.ntc_temperature=GetTemperature(adcvalue);
}
uint8_t Warning_led_SLOW(uint8_t flag_led){

static uint32_t voltmin_tick=0;
  if(TMS_IS_OVER(voltmin_tick,500)){
    TMS_INIT(voltmin_tick);
    if(flag_led==0){
      LED_YELLOW_OFF();
      flag_led=1;
    }else{
      LED_YELLOW_ON();
      flag_led=0;
    } 
  } 
	return flag_led;

}
void Warning_led(uint8_t cnt){
  static uint8_t cnt_led=0;
  static uint8_t flag_led=0;
  static uint32_t voltmin_tick=0;

  Led_shiny=1;
  if(TMS_IS_OVER(voltmin_tick, 200)){
    TMS_INIT(voltmin_tick);
    if(flag_led==0){
      LED_YELLOW_OFF();
      flag_led=1;
    }else{
      LED_YELLOW_ON();
      cnt_led++;
      flag_led=0;
    } 
  } 
  if(cnt_led>cnt){
    Led_shiny=0;
    LED_YELLOW_OFF();
    if(Led_SerialNUM>7){
      Led_SerialNUM=0;
    }else{
      Led_SerialNUM++;
    }
    cnt_led=0;
  }
}

void led_pro(void) {//IS_SWITCH_LOCK()||IS_SWITCH_FREE()


	
  if(Led_shiny==0){
    Led_SerialNUM++;
  }
  if(Flag_leakageamp==1&&Led_SerialNUM==1){
    Warning_led(NUM_leakageamp);
  }
  if(Flag_tempmax==1&&Led_SerialNUM==2){
    Warning_led(NUM_tempmax);
  }
  if(Flag_currmax==1&&Led_SerialNUM==3){
    Warning_led(NUM_currmax);
  }
  if(Flag_short_circuit==1&&Led_SerialNUM==4){
    Warning_led(NUM_short_circuit);
  }
  if(Flag_power_smax==1&&Led_SerialNUM==5){
    Warning_led(NUM_power_smax);
  }
  if(Flag_voltmin==1&&Led_SerialNUM==6){
    Warning_led(NUM_voltmin);
  }
  if(Flag_voltmax==1&&Led_SerialNUM==7){
    Warning_led(NUM_voltmax);
  }
  if(Flag_elecmax==1&&Led_SerialNUM==8){
    Warning_led(NUM_elecmax);
  }
	if(Flag_cross_limitamp==1)
	{
		led_flag2=1;
		led_flag=Warning_led_SLOW(led_flag);
	}else
	{
				led_flag2=0;
	}
				
		
	if(Flag_leakageamp||Flag_tempmax||Flag_currmax||Flag_short_circuit||Flag_power_smax||Flag_voltmin||Flag_voltmax||Flag_elecmax)
	{
			LED_RED_OFF();LED_GREEN_OFF();led_flag2=1;
	}else
	{
			led_flag2=0;Led_SerialNUM=0;Led_shiny=0;
			if (SW_OFF) {
				Flag_cross_limitamp=0;
					LED_GREEN_ON();
				LED_RED_OFF();
			} else if (SW_ON){
				LED_RED_ON();
				LED_GREEN_OFF();
			}else{
				LED_RED_OFF();
				LED_GREEN_OFF();
			}
			if(Flag_cross_limitamp==1)
			{

				led_flag2=1;
			
			}
	}
		if(led_flag2==0)
			{
				LED_YELLOW_OFF();
			}
}

void Test_remotestatus(void){
  if((hand_switch_state==1)&&(Flag_voltmax==0)&&(Flag_voltmin==0)&&(Flag_currmax==0)&&(Flag_power_smax==0)&&(Flag_tempmax==0)&&(Flag_LEAKAGE==0)){
    swremote_control = 1;
  }else{
    swremote_control = 0;
  }
}

/**
 * 开关动作处理
 */
uint8_t swtich_pro(void) {
  
  static uint8_t initial_breakbrake=1;
  uint16_t adcvaluep_back,adcvaluep2_back;

  if(initial_breakbrake){//开关状态初始化
    if(SW_ON){
      workdata.switchcurrentstatus=1;
      last_switchstatus=1;last_switchstate=1;
      workdata.switchhopestatus=1;  
    }
    if(SW_OFF){
      workdata.switchcurrentstatus=0;
      last_switchstatus=0;last_switchstate=0;
      workdata.switchhopestatus=0; 
    }
    initial_breakbrake=0;
  }

  if(SW_ON){//检测当前分合闸状态  0为分闸
    workdata.switchcurrentstatus=1;
//		if(Brakefailure2==1)
//		{
//			workdata.switchhopestatus=1;Brakefailure2=0;
//		}
    MASK_SET(workdata.alarmcode, ALARM_CLOSE);
    MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
    MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
  }
  if(SW_OFF){
    workdata.switchcurrentstatus=0;
    if(!hand_switch_state){
      MASK_SET(workdata.alarmcode, ALARM_MANUAL_OPEN);
    }
    if(SW_Repeatcnt>3 || SW_V_Repeatcnt>3){
      MASK_SET(workdata.alarmcode, ALARM_BRAKEFAILURE);
    }
    MASK_CLEAR(workdata.alarmcode, ALARM_CLOSE);
  }

  if(keyscan()==0){//按键分合闸
    if(SW_OFF)
			{
      //等待分闸霍尔检测
           
        if (SW_OFF) 
					{
						
						
            workdata.switchcurrentstatus =swich_prama(last_switchstate);
						last_switchstate=workdata.switchcurrentstatus;
						workdata.switchhopestatus=workdata.switchcurrentstatus;
            MASK_CLEAR(workdata.alarmcode, ALARM_CLOSE);
            MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
            MASK_SET(workdata.alarmcode, ALARM_MANUAL_OPEN);
          }
          
       
    }else if(SW_ON)
			{
								
                workdata.switchcurrentstatus = swich_prama(last_switchstate);
								last_switchstate=workdata.switchcurrentstatus;
                MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
                MASK_SET(workdata.alarmcode, ALARM_CLOSE);
								workdata.switchhopestatus=workdata.switchcurrentstatus;
           
      }
			else if(!SW_ON&&!SW_OFF)
					{
											
											if(last_switchstate==1)
											{
												workdata.switchcurrentstatus = swich_prama(last_switchstate);
												last_switchstate=workdata.switchcurrentstatus;
												MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
												MASK_SET(workdata.alarmcode, ALARM_CLOSE);
											
