libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
											}else
											{
											
															workdata.switchcurrentstatus = swich_prama(last_switchstate);
															last_switchstate=workdata.switchcurrentstatus;
															MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
															MASK_SET(workdata.alarmcode, ALARM_CLOSE);
															workdata.switchhopestatus=workdata.switchcurrentstatus;
											}
					
								 
				}
		}

  if(workdata.switchcurrentstatus==0){//检测是否手动分合闸
    if(workdata.switchcurrentstatus!=last_switchstatus){
      hand_switch_state=0;
      MASK_CLEAR(workdata.alarmcode, ALARM_CLOSE);
      MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
      MASK_SET(workdata.alarmcode, ALARM_MANUAL_OPEN);
			last_switchstatus=workdata.switchcurrentstatus;
    }
  }else if(workdata.switchcurrentstatus==1){
    MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
    MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
   if(workdata.switchcurrentstatus!=last_switchstatus){
      hand_switch_state=1;
      workdata.switchhopestatus=workdata.switchcurrentstatus;
      last_switchstatus=workdata.switchcurrentstatus;
      MASK_SET(workdata.alarmcode, ALARM_CLOSE);
    }else{
      hand_switch_state=1;

//      MASK_SET(workdata.alarmcode, ALARM_CLOSE);
    }
  }
 
  if(((Flag_RepeatSwitch==1)||(Flag_V_RepeatSwitch==1))&&(SW_RepeatStatus==1)){ //故障重合闸
		
//			if (SW_ON) 
//			{
//				last_switchstate=swich_prama(last_switchstate);
//				workdata.switchcurrentstatus = last_switchstate;
//         
//          MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
//          MASK_SET(workdata.alarmcode, ALARM_CLOSE);
//      }
//			if (SW_OFF) 
//			{
//						last_switchstate=swich_prama(last_switchstate);
//						workdata.switchcurrentstatus = last_switchstate;
//            MASK_CLEAR(workdata.alarmcode, ALARM_CLOSE);
//            MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
//						MASK_SET(workdata.alarmcode, ALARM_MANUAL_OPEN);
//      }
//      SW_RepeatStatus=0;Brakefailure=1;	Flag_RepeatSwitch=0;Flag_V_RepeatSwitch=0;
	
  }
  
  if(!Brakefailure){//故障跳闸
    if (SW_ON)
			{
      
      //等待分闸霍尔检测
						last_switchstate=swich_prama(last_switchstate);
						workdata.switchcurrentstatus = last_switchstate;
						MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
						MASK_SET(workdata.alarmcode, ALARM_CLOSE);
						Brakefailure=1;Brakefailure2=1;
						workdata.switchhopestatus=workdata.switchcurrentstatus;

    }else{
      if(Flag_LEAKAGE && (SW_Repeatcnt>3)){//漏电锁止
        				last_switchstate=swich_prama(last_switchstate);
								workdata.switchcurrentstatus = last_switchstate;



      }
    }
  }  
  
  

  Test_remotestatus();//检测远程控制允许状态
  if(!swremote_control){
    return -1;
  }
  
  if (workdata.switchhopestatus != workdata.switchcurrentstatus) {//
    if (workdata.switchhopestatus == 1) {
       if (SW_OFF)
			{
      
      //等待分闸霍尔检测
						last_switchstate=swich_prama(last_switchstate);
            workdata.switchcurrentstatus = last_switchstate;
            last_switchstatus=workdata.switchcurrentstatus;
            MASK_SET(workdata.alarmcode, ALARM_CLOSE);
            MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
            MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
						workdata.switchhopestatus=workdata.switchcurrentstatus;
          
      }
    } else if (workdata.switchhopestatus == 0) {

         if(SW_ON) {
							last_switchstate=swich_prama(last_switchstate);
              workdata.switchcurrentstatus = last_switchstate;
              last_switchstatus=workdata.switchcurrentstatus;
              MASK_CLEAR(workdata.alarmcode, ALARM_CLOSE);
              MASK_CLEAR(workdata.alarmcode, ALARM_MANUAL_OPEN);
              MASK_CLEAR(workdata.alarmcode, ALARM_BRAKEFAILURE);
							workdata.switchhopestatus=workdata.switchcurrentstatus;

           
        }
      }
  }
  return 0;
}
/**
 * 电机PWM驱动   合闸快速
 */
void SW_close_speedfast(void)
{
  Duty_ratio=100;
  Pwm_Cycle=20;
  MX_TIM15_Init();
  HAL_TIM_PWM_Start(&htim15, TIM_CHANNEL_2);
}

/**
 * 电机PWM驱动   合闸低速
 */
void SW_close_speedslow(void)
{
  Duty_ratio=100;
  Pwm_Cycle=10;
  MX_TIM15_Init();
  HAL_TIM_PWM_Start(&htim15, TIM_CHANNEL_2);
}
/**
 * 电机PWM驱动   分闸
 */
void SW_break(void)
{
  Duty_ratio=moter_openzkb;
  Pwm_Cycle=666;
  MX_TIM15_Init();
  HAL_TIM_PWM_Start(&htim15, TIM_CHANNEL_2);
}
/**
 * 电机PWM驱动   分闸
 */
void SW_break2(void)
{
  Duty_ratio=moter_openzkb;
  Pwm_Cycle=666;
  MX_TIM15_Init();
  HAL_TIM_PWM_Start(&htim15, TIM_CHANNEL_2);
}
uint8_t flag_PK=0;
/**
 * 报警事件处理
 */
void alarm_pro(void) {
  static uint32_t volt_tick = 0;
  static uint32_t leakage_test_tick = 0;
  static uint32_t RepeatSwitchtick = 0;
  static uint32_t V_RepeatSwitchtick = 0;
  static uint32_t amp_tick1 = 0;
  static uint32_t amp_tick2 = 0;
  static uint32_t amp_tick3 = 0;
  static uint32_t power_p_tick = 0;
  static uint32_t temperature_tick = 0;
  static uint8_t temperature_overtick=0;
uint8_t flag=0;


  if(SW_ON){
	Flag_leakageamp=0;
  Flag_tempmax=0;
  Flag_currmax=0;
  Flag_short_circuit=0;
  Flag_power_smax=0;
  Flag_voltmin=0;
  Flag_voltmax=0;
  Flag_elecmax=0;
		Brakefailure=1;
    Flag_RepeatSwitch = 0;
    Flag_V_RepeatSwitch = 0;
    Flag_LeakageTestRepeatSwitch=0;
		att7053pro();
			//	workdata.ntc_temperature=91;
//		workdata.attdata.leakageamp=23;
//		workdata.attdata.amp=25600;
//		workdata.attdata.volt=271;
//		workdata.attdata.power_s =2300;
		 if (workdata.ntc_temperature > workpara.limit_temperature) {      
     if (TMS_IS_OVER(temperature_tick, 500)) { //过温提醒时延
       MASK_SET(workdata.alarmcode, ALARM_TEMPERATURE);//过温提醒
     }
			}else{
				MASK_CLEAR(workdata.alarmcode, ALARM_TEMPERATURE);
				TMS_INIT(temperature_tick);
			} 
			if (workdata.ntc_temperature > (workpara.limit_temperature+10)){
				if (TMS_IS_OVER(temperature_overtick, 500)) { //过温保护时延
					MASK_SET(workdata.alarmcode, ALARM_TEMPERATURE_OVER);//过温保护
					Brakefailure=0;
					Flag_tempmax=1;
					Flag_RepeatSwitch = 1; //1019
				 }           
			} else {
				MASK_CLEAR(workdata.alarmcode, ALARM_TEMPERATURE_OVER);
				TMS_INIT(temperature_overtick);
				if(swremote_control){
		/*      TMS_INIT(RepeatSwitchtick);
					SW_Repeatcnt=1;*/
					Flag_RepeatSwitch = 0;
				}
				Flag_tempmax=0;
			}
		
		if (!IS_LEAKAGE_TEST()) { //漏电检测
    HAL_Delay(10);
    if(!IS_LEAKAGE_TEST()){
      
//      if((SW_OFF) && (workdata.attdata.leakageamp>=REFERENCE_LEAKGEAMP)&&(workdata.attdata.leakageamp<=100)){
//        Flag_leakagetest=1;
//      last_switchstate=swich_prama(last_switchstate);
//      }
//      HAL_Delay(1000);
//        if(Flag_leakagetest==1){
//          if(SW_ON){
//            last_switchstate=swich_prama(last_switchstate);
//						}
//          }
                    
    }else{
      TMS_INIT(leakage_test_tick);
    }
  }
  
