libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
  if ((IS_LEAKAGE_TEST()) && (workdata.attdata.leakageamp>=REFERENCE_LEAKGEAMP && workdata.attdata.leakageamp<=100)&&(Flag_leakagetest==0)) { //漏电保护
//      MASK_SET(workdata.alarmcode, ALARM_LEAKAGE);
//      workdata.leakageteststatus=0;
//      Brakefailure=0;
//      Flag_LEAKAGE=1;Flag_leakageamp=1;
//      Flag_RepeatSwitch = 1;  //1019
  }else{
    MASK_CLEAR(workdata.alarmcode, ALARM_LEAKAGE);
    workdata.leakageteststatus=1;
    Flag_LEAKAGE=0;
  }
  
  Flag_leakagetest=0;
    if ((workdata.attdata.volt > workpara.limit_volt_high)) 
			{
				HAL_Delay(10);
				read_rms(ATT7053_REG_V_RMS, &workdata.attdata.volt, 0.010445654);

				 if ((workdata.attdata.volt > workpara.limit_volt_high)) 
					 {
								MASK_CLEAR(workdata.alarmcode, ALARM_VOLTAGE_LOW);
								if (TMS_IS_OVER(volt_tick, 1000)) { //过压时延
									MASK_SET(workdata.alarmcode, ALARM_VOLTAGE_HIGH);//过压保护事件
									Brakefailure=0;
									Flag_voltmax=1;
									Flag_V_RepeatSwitch = 1;  //1019
								}
					}
    } else if ((workdata.attdata.volt < workpara.limit_volt_low)&&(workdata.attdata.volt >100) ) 
		{
				dianya=workdata.attdata.volt;
				HAL_Delay(10);
				read_rms(ATT7053_REG_V_RMS, &workdata.attdata.volt, 0.010445654);
				if ((workdata.attdata.volt < workpara.limit_volt_low)&&(workdata.attdata.volt >100) ) 
					{
								if (TMS_IS_OVER(volt_tick,1000)) { //欠压时延
									MASK_CLEAR(workdata.alarmcode, ALARM_VOLTAGE_HIGH);
									MASK_SET(workdata.alarmcode, ALARM_VOLTAGE_LOW);//欠压保护事件
									Brakefailure=0;
									Flag_voltmin=1;
									Flag_V_RepeatSwitch = 1;  //1019
								}
					}
    } else {
      MASK_CLEAR(workdata.alarmcode, ALARM_VOLTAGE_HIGH | ALARM_VOLTAGE_LOW);
      TMS_INIT(volt_tick);
      if(swremote_control){
/*        TMS_INIT(V_RepeatSwitchtick);
        SW_Repeatcnt=1;*/
//        Flag_V_RepeatSwitch = 0;  
      }
      Flag_voltmax=0;
      Flag_voltmin=0;
    }
//		workdata.attdata.amp=14500;
			if ((workdata.attdata.amp >= (workpara.limit_amp*90/100)) && (workdata.attdata.amp < (workpara.limit_amp*145/100))) { //过流事件 
				Flag_cross_limitamp=1;
      }else
			{
				Flag_cross_limitamp=0;
			}
    if ((workdata.attdata.amp >= (workpara.limit_amp*113/100)) && (workdata.attdata.amp < (workpara.limit_amp*145/100))) { //过流事件
//      if (TMS_IS_OVER(amp_tick1, 3600000)) { 
//        Flag_w_currmax=1;
//      }
//      if(Flag_w_currmax){
////        Brakefailure=0;
//        Flag_currmax=1;    //1019    
//        Flag_RepeatSwitch = 1;
//        MASK_SET(workdata.alarmcode, ALARM_AMPOVER);
//        TMS_INIT(amp_tick2);
//        TMS_INIT(amp_tick3);
//      }
    }else if(((workdata.attdata.amp) >= (workpara.limit_amp*145/100)) && (workdata.attdata.amp < (workpara.limit_amp*255/100))){
      if(TMS_IS_OVER(amp_tick2, 5000)){
        Flag_w_currmax=1;
      }
      if(Flag_w_currmax){
        Brakefailure=0;
        Flag_currmax=1; //1019
        Flag_RepeatSwitch = 1;
        MASK_SET(workdata.alarmcode, ALARM_AMPOVER);
        TMS_INIT(amp_tick3);
      }
    }else if((workdata.attdata.amp >= (workpara.limit_amp*255/100)) && (workdata.attdata.amp < (workpara.limit_amp*5))){
      MASK_SET(workdata.alarmcode, ALARM_SHORTANTICIPATION);
      if(TMS_IS_OVER(amp_tick3, 1000)){
        Flag_w_currmax=1;
      }
      if(Flag_w_currmax){
        Brakefailure=0;
        Flag_currmax=1; //1019
        Flag_RepeatSwitch = 1;
        MASK_SET(workdata.alarmcode, ALARM_AMPOVER);
      }
    }else if(workdata.attdata.amp >= (workpara.limit_amp*5)){
      Brakefailure=0;
      Flag_currmax=1; //1019
      Flag_RepeatSwitch = 1;
      MASK_SET(workdata.alarmcode, ALARM_SHORT);
      MASK_SET(workdata.alarmcode, ALARM_AMPOVER);
      workpara.ShortTripp_times++;
      saveparam();
    }else {
      MASK_CLEAR(workdata.alarmcode, ALARM_AMPOVER|ALARM_SHORT|ALARM_SHORTANTICIPATION);
      TMS_INIT(amp_tick1);
      TMS_INIT(amp_tick2);
      TMS_INIT(amp_tick3);
      if(swremote_control){
/*        TMS_INIT(RepeatSwitchtick);        
        SW_Repeatcnt=1;*/
//        Flag_RepeatSwitch = 0;
      }
      Flag_w_currmax=0;
      Flag_currmax=0;
    }

    if (workdata.attdata.power_s > workpara.limit_power_s) {
      if (TMS_IS_OVER(power_p_tick, 500)) { //过载时延
        MASK_SET(workdata.alarmcode, ALARM_POWER);//过载保护事件
        Brakefailure=0;
        Flag_power_smax=1;  //1019
        Flag_RepeatSwitch = 1;
      }
    } else {
      MASK_CLEAR(workdata.alarmcode, ALARM_POWER);
      TMS_INIT(power_p_tick);
      if(swremote_control){
/*      TMS_INIT(RepeatSwitchtick);
        SW_Repeatcnt=1;*/
//        Flag_RepeatSwitch = 0;
      }   
      Flag_power_smax=0;
    }
  }
  
  if(Flag_V_RepeatSwitch==1||Flag_RepeatSwitch==1||Flag_RepeatSwitch==1)
	{
			//重合闸优先级，过欠压重合闸优先级最高
				if(Flag_V_RepeatSwitch)
				{
								if (TMS_IS_OVER(V_RepeatSwitchtick, 1000)){
											SW_RepeatStatus=0;
											if(SW_V_Repeatcnt<3){//记录重合闸次数，3次后不再合闸
												SW_RepeatStatus=1;
												SW_V_Repeatcnt+=1;
												TMS_INIT(V_RepeatSwitchtick);
											}
											if((SW_V_Repeatcnt>=3)&&(SW_OFF)){
												Flag_V_RepeatSwitch=0;
												MASK_SET(workdata.alarmcode, ALARM_BRAKEFAILURE); 
											}      
								}
					}
				else if(Flag_RepeatSwitch)
					{
										if(Flag_LeakageTestRepeatSwitch==1){
											if(SW_Repeatcnt<1){//漏电测试
												SW_RepeatStatus=1;
												SW_Repeatcnt+=1;
												TMS_INIT(RepeatSwitchtick);
											}else
											{
												Flag_RepeatSwitch=0;
											}
										}else if(Flag_RepeatSwitch)
										{      
														if (TMS_IS_OVER(RepeatSwitchtick, 1000))
														{       
																if(SW_Repeatcnt<3)
																{
																	SW_RepeatStatus=1;
																	SW_Repeatcnt+=1;
																	TMS_INIT(RepeatSwitchtick);
																}
																
																if((SW_V_Repeatcnt>3)&&(SW_OFF))
																{
																		Flag_RepeatSwitch=0;
																	MASK_SET(workdata.alarmcode, ALARM_BRAKEFAILURE);  SW_Repeatcnt=0;      
																}      
														}
										}
					}
		}else{
				TMS_INIT(RepeatSwitchtick);
				TMS_INIT(V_RepeatSwitchtick);
				SW_Repeatcnt=0;
				Flag_RepeatSwitch = 0;
				SW_V_Repeatcnt=0;
				Flag_V_RepeatSwitch = 0;
				Flag_LeakageTestRepeatSwitch=0;
			}

//		if(flag_PK==0)
//		{
//										Brakefailure=0;
////			Flag_cross_limitamp=1;
////			Flag_tempmax=1;
////			Flag_currmax=1;
////			Flag_short_circuit=1;
////			Flag_power_smax=1;
//			Flag_voltmin=1;
////			Flag_voltmax=1;
////			Flag_elecmax=1;
////			//Flag_power_smax=1;
////								//	Flag_voltmin=1;
////			 //Flag_LEAKAGE=1;
////			Flag_leakageamp=1;
////									Flag_V_RepeatSwitch = 1;  //1019
//			flag_PK=1;
//		}else if(flag_PK==1)
//		{
//			Flag_voltmax=1;flag_PK=2;Brakefailure=0;
//		
//		}

			
