libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
		}


static void onlineset(uint8_t set) {
  workdata.onlinestatus = set;
}

static uint8_t basicinfopack(uint8_t* pdata, uint8_t* plen) {
  uint8_t* p = NULL;
  p = pdata;
  *p++ = workpara.version;
  *p++ = workpara.type;
  *p++ = workpara.np;
  *p++ = (uint8_t)(workpara.mode >> 8);
  *p++ = (uint8_t)(workpara.mode);
  *p++ = workpara.limit_temperature;
  *p++ = workpara.limit_leakage;
  *p++ = (uint8_t)(workpara.limit_volt_high >> 24);
  *p++ = (uint8_t)(workpara.limit_volt_high >> 16);
  *p++ = (uint8_t)(workpara.limit_volt_high >> 8);
  *p++ = (uint8_t)(workpara.limit_volt_high);
  *p++ = (uint8_t)(workpara.limit_volt_low >> 24);
  *p++ = (uint8_t)(workpara.limit_volt_low >> 16);
  *p++ = (uint8_t)(workpara.limit_volt_low >> 8);
  *p++ = (uint8_t)(workpara.limit_volt_low);
  *p++ = (uint8_t)(workpara.limit_amp >> 24);
  *p++ = (uint8_t)(workpara.limit_amp >> 16);
  *p++ = (uint8_t)(workpara.limit_amp >> 8);
  *p++ = (uint8_t)(workpara.limit_amp);
  *p++ = (uint8_t)(workpara.limit_power_s >> 24);
  *p++ = (uint8_t)(workpara.limit_power_s >> 16);
  *p++ = (uint8_t)(workpara.limit_power_s >> 8);
  *p++ = (uint8_t)(workpara.limit_power_s);
  *p++ = (uint8_t)(workpara.limit_enery >> 24);
  *p++ = (uint8_t)(workpara.limit_enery >> 16);
  *p++ = (uint8_t)(workpara.limit_enery >> 8);
  *p++ = (uint8_t)(workpara.limit_enery);
  *p++ = (uint8_t)(workpara.volt_action_time);
  *p++ = (uint8_t)(workpara.volt_recovery_time);
  *p++ = (uint8_t)(workpara.Leakage_detection);
 // *p++ = (uint8_t)(workdata.switchauto);
  *plen = p - pdata;
  return *plen;
}

static  uint8_t readpara(uint8_t* pdata, uint8_t para_num, uint8_t* plen){
  uint8_t* p = NULL;

  p = pdata;

  *p++ =para_num;

  *p++ =0x01;
  *p++ =4;
  *p++ = (uint8_t)(workpara.limit_power_s >> 24);
  *p++ = (uint8_t)(workpara.limit_power_s >> 16);
  *p++ = (uint8_t)(workpara.limit_power_s >> 8);
  *p++ = (uint8_t)(workpara.limit_power_s);

  *p++ =0x02;
  *p++ =4;
  *p++ = (uint8_t)(workpara.limit_enery >> 24);
  *p++ = (uint8_t)(workpara.limit_enery >> 16);
  *p++ = (uint8_t)(workpara.limit_enery >> 8);
  *p++ = (uint8_t)(workpara.limit_enery);

  *p++ =0x03;
  *p++ =1;
  *p++ = workpara.limit_temperature;

  *p++ =0x04;
  *p++ =4;
  *p++ = (uint8_t)(workpara.limit_amp >> 24);
  *p++ = (uint8_t)(workpara.limit_amp >> 16);
  *p++ = (uint8_t)(workpara.limit_amp >> 8);
  *p++ = (uint8_t)(workpara.limit_amp);

  *p++ =0x05;
  *p++ =4;
  *p++ = (uint8_t)(workpara.limit_volt_high >> 24);
  *p++ = (uint8_t)(workpara.limit_volt_high >> 16);
  *p++ = (uint8_t)(workpara.limit_volt_high >> 8);
  *p++ = (uint8_t)(workpara.limit_volt_high);

  *p++ =0x06;
  *p++ =4;
  *p++ = (uint8_t)(workpara.limit_volt_low >> 24);
  *p++ = (uint8_t)(workpara.limit_volt_low >> 16);
  *p++ = (uint8_t)(workpara.limit_volt_low >> 8);
  *p++ = (uint8_t)(workpara.limit_volt_low);

  *p++ =0x07;
  *p++ =1;
  *p++ = workpara.volt_action_time;

  *p++ =0x08;
  *p++ =1;
  *p++ = (uint8_t)(workpara.volt_recovery_time);

  *p++ =0x09;
  *p++ =1;
  *p++ = workpara.Leakage_detection;
  
  *p++ =0x0A;
  *p++ =4;
  *p++ = (uint8_t)(workpara.sn >> 24);
  *p++ = (uint8_t)(workpara.sn >> 16);
  *p++ = (uint8_t)(workpara.sn >> 8);
  *p++ = (uint8_t)(workpara.sn);

  *plen = p - pdata + 1;
  return *plen;
}

static uint8_t writepara(uint8_t* pdata,uint8_t* rec_buf,uint8_t* plen){
  static uint8_t num;
  uint32_t status=0;
  uint8_t  para_cnt=0;
  uint8_t  para_len=0;
  uint8_t  para_id=0;
  uint8_t  index=9;
  uint8_t* p = NULL;
  p = pdata;
  num=0;
  memcpy(&para_cnt, rec_buf + 8, 1);
  for(uint8_t i=0;i<para_cnt;i++){
    memcpy(&para_id, rec_buf + index, 1);
    index++;
    memcpy(&para_len, rec_buf + index, 1);
    index++;
    memcpy(&status, rec_buf + index, para_len);
    index+=para_len;

    if(para_len==4){
      int32tBS(&status);
    }else if(para_len==2){
      int16tBS((uint16_t *)&status);
    }
    
    switch(para_id){
      case 0x01:
       workpara.limit_power_s=status;
       num++; 
      break;

      case 0x02:
      workpara.limit_enery=status;
      num++; 
      break;

      case 0x03:
       workpara.limit_temperature=status;
       num++; 
      break;

      case 0x04:
       workpara.limit_amp=status;
       num++; 
      break;

      case 0x05:
       workpara.limit_volt_high=status;
       num++; 
      break;

      case 0x06:
       workpara.limit_volt_low=status;
       num++; 
      break;

      case 0x07:
       workpara.volt_action_time=status;
       num++; 
      break;

      case 0x08:
       workpara.volt_recovery_time=status;
       num++; 
      break;

      case 0x09:
       workpara.Leakage_detection=status;
       num++; 
      break;
      
      case 0x0A:
       workpara.sn=status;
       num++; 
      break;
    }
  }
  if(num==para_cnt){
    num=0;
    *p++=0x00;
    saveparam();
  }else{
  *p++=0x01;
  num=0;
  }
  *plen = p - pdata + 1;
  return *plen;
}

static  uint8_t currentinfopack(uint8_t* pdata, uint8_t* plen) {
  uint8_t* p = NULL;
	double buchang_baifen=0.97654321;
	uint32_t total_enery_p=0;
	total_enery_p=workpara.total_enery_p;
	total_enery_p=(uint32_t)(total_enery_p*buchang_baifen);
  p = pdata;
  *p++ = workpara.type;
  *p++ = workpara.np;
  *p++ = (uint8_t)(workpara.mode >> 8);
  *p++ = (uint8_t)(workpara.mode);
  *p++ = workdata.switchcurrentstatus;
  *p++ = workdata.thunderstatus;
  *p++ = workdata.ntc_temperature;
  *p++ = workdata.attdata.leakageamp;
  *p++ = (uint8_t)(workdata.alarmcode >> 8);
  *p++ = (uint8_t)(workdata.alarmcode);
  *p++ = (uint8_t)(workdata.attdata.power_ps >> 8);
  *p++ = (uint8_t)(workdata.attdata.power_ps);
  *p++ = (uint8_t)(workdata.attdata.volt >> 24);
  *p++ = (uint8_t)(workdata.attdata.volt >> 16);
  *p++ = (uint8_t)(workdata.attdata.volt >> 8);
  *p++ = (uint8_t)(workdata.attdata.volt);
  *p++ = (uint8_t)(workdata.attdata.amp >> 24);
  *p++ = (uint8_t)(workdata.attdata.amp >> 16);
  *p++ = (uint8_t)(workdata.attdata.amp >> 8);
  *p++ = (uint8_t)(workdata.attdata.amp);
  *p++ = (uint8_t)(workdata.attdata.power_p >> 8);
  *p++ = (uint8_t)(workdata.attdata.power_p);
  //*p++ = (uint8_t)(workdata.attdata.power_q >> 8);
  //*p++ = (uint8_t)(workdata.attdata.power_q);
  //*p++ = (uint8_t)(workdata.attdata.power_s >> 8);
  //*p++ = (uint8_t)(workdata.attdata.power_s);
  *p++ = (uint8_t)(total_enery_p >> 24);
  *p++ = (uint8_t)(total_enery_p >> 16);
  *p++ = (uint8_t)(total_enery_p >> 8);
  *p++ = (uint8_t)(total_enery_p);
  *p++ = (uint8_t)(workpara.total_enery_q >> 24);
  *p++ = (uint8_t)(workpara.total_enery_q >> 16);
  *p++ = (uint8_t)(workpara.total_enery_q >> 8);
  *p++ = (uint8_t)(workpara.total_enery_q);
  *p++ = (uint8_t)(workpara.total_enery_s >> 24);
  *p++ = (uint8_t)(workpara.total_enery_s >> 16);
  *p++ = (uint8_t)(workpara.total_enery_s >> 8);
  *p++ = (uint8_t)(workpara.total_enery_s);
  *p++ = (uint8_t)(workpara.ShortTripp_times >> 8);
  *p++ = (uint8_t)(workpara.ShortTripp_times);
  
  *plen = p - pdata + 1;
  return *plen;
}

