libulubulu-byte/stm32_all_project/2p IoT Circuit Breaker  Smart MCB  Smart MCCB/user_app/src/proc.c
static int8_t  setswitch(uint8_t *swtich ,uint8_t array, uint8_t address, uint32_t status) {
  uint8_t temp = 0;
  temp = array * 32;
  if (address > temp) {
    address -= temp;
  } else {
    return -1;
  }
  if (status ) {
    *swtich = 1;
//    network_switch_state=1;
  } else {
    *swtich = 0;
//    network_switch_state=0;
  }
  return 0;
}

void saveparam(void)
{
  workpara.crc = CRC_16(0xFFFF, (uint8_t*)&workpara + 2, OBJ_LEN(workpara) - 2);
  Flash_PageErase(WORK_PARA_SECTOR_ADDR);
  FlashWrite(WORK_PARA_SECTOR_ADDR,(uint8_t *)&workpara,sizeof(workpara));
}


uint8_t cmddatapack(uint8_t cmd, uint8_t addr, uint32_t sn,
                    uint8_t* psdata, uint8_t slen,
                    uint8_t* pddata, uint8_t* pdlen) {
  uint8_t* p = NULL;
  uint8_t len = 0;
  p = pddata;
  *p++ = 0x7E;
  *p++ = addr;
  int32tBS(&sn);
  memcpy(p, &sn, 4);
  p += 4;
  *p++ = cmd|0x80;
  *p++ = slen;
  memcpy(p, psdata, slen);
  p += slen;
  len = slen + 8;
  uint16_t crc = 0;
  crc = CRC_16(0xFFFF, pddata, len);
  int16tBS(&crc);
  memcpy(p, &crc, 2);
  p += 2;
  *p = 0x7E;
  len += 3;
  *pdlen = len;
  return    len;
}

static uint8_t askdata[100] = { 0, 0 };
int8_t cmddataproc(uint8_t* pdata, uint8_t len) 
{
	static uint16_t crc = 0,crc2 = 0;
	static  uint8_t debugcnt = 0;
	static uint8_t order = 0;
	static uint8_t sort_flag = 0;
	
	uint8_t address = 0;
	uint32_t sn = 0;
	/*包头必须是0x7E*/
	if (*(pdata + len - 1) != 0x7E) {
		return -1;
	}  
	crc = (*(pdata + len - 3) << 8) + (*(pdata + len - 2));
	crc2 = CRC_16(0xFFFF, pdata, len - 3);
	if (crc != crc2){
		return -2;
	} 
	address = *(pdata + 1);
	order 	= *(pdata + 6);	//指令类型
	memcpy(&sn, pdata + 2, 4);
	int32tBS(&sn);//大小端转换
	debugcnt++;
	
	if((address != workpara.address)&&(order != CMD_SORT_ORDER)) {
		return -2;
	}
	
	uint8_t asklen = 0;
	uint8_t para_num=9;
	uint32_t status = 0;
  
	switch (order) {
		case CMD_CLEAR_ONLINE:
			onlineset(0);//设置为离线
			asklen = 0;
			break;
		case CMD_CHECK_ONLINE:
			onlineset(1);//设置为在线
			askdata[0] = workpara.type;//返回设备类型
			asklen = 1;
			break;

		case CMD_INQUIRE_BASIC_INFO:
			basicinfopack(askdata, &asklen);//基本信息打包
			break;

		case CMD_INQUIRE_CURRENT_INFO:
			currentinfopack(askdata, &asklen);//当前信息打包
			break;

		case CMD_READ_WORK_PARA:
			readpara(askdata, para_num, &asklen);//读取属性
			break;

		case CMD_WRITE_WORK_PARA:
			writepara(askdata,pdata,&asklen);//设置参数
			break;
		
		case CMD_SET_TEMPE:
			memcpy(&status, pdata + 9, 2);
			int16tBS((uint16_t *)&status);
			workpara.limit_temperature = status;//设置温度阈值
			saveparam();
			break;
		
		case CMD_READ_ATT_PARA:

			break;
		case CMD_SET_ATT_PARA:
	
			break;
		case CMD_CLEAR_ATT_PARA:

			break;
		
		case CMD_SET_LIMITVOLAT_H: 
		{
			uint32_t status = 0;
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			workpara.limit_volt_high = status;//设置电压上限
			saveparam();
			break;
		}
			
		case CMD_SET_LIMITVOLAT_L: 
		{
			uint32_t status = 0;
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			workpara.limit_volt_low = status;//设置电压下限
			saveparam();
			break;
		}
		
		case CMD_SET_SWITCH: 
		{
			uint32_t status = 0;
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			if (hand_switch_state==1) {
				if(status==0){
					workdata.switchhopestatus=0;//开关期望状态，远程控制
				}else{
					workdata.switchhopestatus=1;
				}         
				askdata[0] = 0;
				asklen = 1;
			} else {
				askdata[0] = 1;
				asklen = 1;
			}
			break;
		}
      
		case CMD_AUTO_ALLOW: 
		{
			uint32_t status = 0;
			uint8_t array = *(pdata + 8);
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			setswitch(&workdata.switchauto, array, workpara.address, status);
			break;
		}
      
		case CMD_SET_LIMITAMP_PARA: 
		{
			uint32_t status = 0;
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			workpara.limit_amp = status;//电流阈值
			askdata[0] = 0;
			asklen = 1;
			saveparam();
			break;
		}
      
		case CMD_SET_LIMITPOWER_PARA: 
		{
			uint32_t status = 0;
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			workpara.limit_power_s = status;//功率阈值
			askdata[0] = 0;
			asklen = 1;
			saveparam();
			break;	
		}
      
		case CMD_READ_ALL_WORK_PARA: 
		{
			asklen = sizeof(workpara);
			memcpy(askdata, (uint8_t*)&workpara, asklen);//读取全部工作参数
			break;
		}
      
		case CMD_SORT_ORDER:
			/*IO判断，排序时在所有分机地址一致的情况下用于判断那个分机占有总线的通信权*/
//			if (SORT_IN() == 0){ 
//				workpara.address = address;//设置分机地址   
//				askdata[0] = 0;
//				asklen = 1;
//				saveparam();//保存工作参数
//			}
			if (SORT_IN() == 0 || SORT_INs() == 0){ 
				workpara.address = address;//设置分机地址   
				askdata[0] = 0;
				asklen = 1;
				saveparam();//保存工作参数
			}		
			break;
			
		case CMD_NOT_MANUAL: 
		{
			uint32_t status = 0;
			uint8_t array = *(pdata + 8);
			memcpy(&status, pdata + 9, 4);
			int32tBS(&status);
			setswitch(&workdata.switchnotset, array, workpara.address, status);
			workdata.switchhopestatus = 0;
			break;
		}
	
			
		case CMD_SORT_LEVE:
		{
			uint32_t status = 0;
			if(sn==workpara.sn){       
				memcpy(&status, pdata + 8, 1);
//				if(status==0){
//					SORT_OUT_LOW();
//				}else{
//					SORT_OUT_HIGH();
//				}
				if(status==0){
					if(SORT_IN() == 0){
						SORT_OUT_LOW();
						sort_flag = 1;
					}
					if(SORT_INs() == 0){
						SORT_OUT_LOWs();
						sort_flag = 2;
					}
				}else{
					if(SORT_IN() == 0 || sort_flag == 1){
						SORT_OUT_HIGH();
						sort_flag = 0;
					}
					if(SORT_INs() == 0|| sort_flag == 2){
						SORT_OUT_HIGHs();
						sort_flag = 0;
					}						
				}  					
				askdata[0] = 0;
				asklen = 1;
			}
			break;
		}
		
		default:
			break;

	}
	if (address == 0 || sn == 0) { 
		asklen = 0;
	}
	if (asklen > 0) {
		static uint8_t senddata[100];
		static uint8_t sendlen = 0;
		cmddatapack(order,
					workpara.address, 
					workpara.sn,
					askdata, 
					asklen,
					senddata, 
					&sendlen);
		UART_WriteBlocking_ex(senddata, sendlen);//发送数据
	}
	return 0;
}
/*
void test(void){
    static uint8_t senddata[100]={"asdfaasdf"};
    uint8_t sendlen = 9;
    UART_WriteBlocking_ex(senddata, sendlen);
}
*/
uint8_t keyscan(){
  static uint8_t key_up=1;
  if(key_up==1 && IS_SW_TEST_STATUS()==0){
    TS_DELAY(15);
    key_up=0;
    if(IS_SW_TEST_STATUS()==0){
      return 0;
    }
  }
  if(IS_SW_TEST_STATUS()==1){
    if(key_up==0){
      key_up=1;
      return 1;
    }    
  }
  return 1;
}

void delayms(uint32_t ms) {
  uint32_t tick = 0;
  tick = gettickms();
//  TMS_INIT(tick);
  while (TMS_IS_OVER(tick, ms));
}

void adjust_cali_para_all(void) {
  static uint8_t debug_temp[4];
  write_att7053bu(ATT7053_REG_WP, 0xA6);
  adjust_cali_para(ATT7053_REG_HFCONST, workpara.calibration.hf_const);
  read_att7053bu(ATT7053_REG_HFCONST, debug_temp);
  adjust_cali_para(ATT7053_REG_GP1, workpara.calibration.gp1);
  adjust_cali_para(ATT7053_REG_GQ1, workpara.calibration.gp1);
  adjust_cali_para(ATT7053_REG_GS1, workpara.calibration.gp1);
  adjust_cali_para(ATT7053_REG_GPHASE1, workpara.calibration.gphase1);
  adjust_cali_para(ATT7053_REG_P1_OFT_H, (uint8_t)(workpara.calibration.poffset1 >> 8));
  adjust_cali_para(ATT7053_REG_P1_OFT_L, (uint8_t)(workpara.calibration.poffset1));
  
  write_att7053bu(ATT7053_REG_WP, 0x00);
}

